app/views/dashboard/index.html.erb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" IN ($1, $2)  [["project_id", 4], ["project_id", 6]]
SELECT COUNT(*) FROM "milestones" WHERE "milestones"."project_id" = $1  [["project_id", 4]]
---
                  <p class="px-2 inline-flex text-xs leading-5 font-semibold rounded-full bg-green-100 text-green-800">
                    <%= project.milestones.count %> milestones