app/controllers/admin/dashboard_controller.rb

  def index
    @total_projects = Project.count
    @total_users = User.count
    @total_transactions = Transaction.count
    @total_in_escrow = Milestone.funded.sum(:amount_cents) + Milestone.completed.sum(:amount_cents)

    @recent_projects = Project.includes(:client, :developer).order(created_at: :desc).limit(5)
---
SELECT COUNT(*) FROM "projects"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "transactions"
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC LIMIT $1  [["LIMIT", 5]]