app/views/projects/index.html.erb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" IN ($1, $2)  [["project_id", 4], ["project_id", 6]]
SELECT COUNT(*) FROM "milestones" WHERE "milestones"."project_id" = $1  [["project_id", 4]]
---
                <span class="font-medium text-gray-900">
                  <%= project.milestones.count %>