app/views/projects/show.html.erb

SELECT 1 AS one FROM "transactions" WHERE "transactions"."milestone_id" = $1 LIMIT $2  [["milestone_id", 15], ["LIMIT", 1]]
---
                    <span>Created: <%= milestone.created_at.strftime("%B %d, %Y") %></span>
                    <% if milestone.transactions.any? %>