app/controllers/dashboard_controller.rb

  def index
    @user = current_user

    if @user.client?
      @client_projects = @user.client_projects.includes(:milestones, :developer)
      @total_in_escrow = @user.client_projects.joins(:milestones).where(milestones: { status: [:funded, :completed] }).sum('milestones.amount_cents')
    elsif @user.developer?
      @developer_projects = @user.developer_projects.includes(:milestones, :client)
      @total_earned = @user.developer_projects.joins(:milestones).where(milestones: { status: :released }).sum('milestones.amount_cents')
    elsif @user.admin?
      @total_projects = Project.count
      @total_transactions = Transaction.completed.count
      @total_in_escrow = Milestone.funded.sum(:amount_cents) + Milestone.completed.sum(:amount_cents)
---
SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" IN ($1, $2)  [["project_id", 4], ["project_id", 6]]
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = $1  [["client_id", 7]]
SELECT SUM("milestones"."amount_cents") FROM "projects" INNER JOIN "milestones" ON "milestones"."project_id" = "projects"."id" WHERE "projects"."client_id" = $1 AND "milestones"."status" IN ($2, $3)  [["client_id", 7], ["status", 1], ["status", 2]]
SELECT SUM("milestones"."amount_cents") FROM "milestones" WHERE "milestones"."status" = $1  [["status", 1]]
SELECT COUNT(*) FROM "projects"
SELECT COUNT(*) FROM "milestones" WHERE "milestones"."project_id" = $1  [["project_id", 4]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."client_id" = $1 AND "projects"."status" = $2  [["client_id", 7], ["status", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."status" = $1  [["status", 2]]