app/controllers/disputes_controller.rb

INSERT INTO "disputes" ("milestone_id", "raised_by_id", "reason", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["milestone_id", 15], ["raised_by_id", 11], ["reason", "asdasdasdasd"], ["status", 0], ["created_at", "2025-08-21 17:41:45.901336"], ["updated_at", "2025-08-21 17:41:45.901336"]]
---
  def create
    @dispute = @milestone.disputes.build(dispute_params)
    @dispute.raised_by = current_user
    @dispute.status = :open

    if @dispute.save

SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" = $1 AND "milestones"."id" = $2 LIMIT $3  [["project_id", 7], ["id", 15], ["LIMIT", 1]]
---
  def set_milestone
    @milestone = @project.milestones.find(params[:milestone_id])