app/controllers/milestones_controller.rb

  def create
    @milestone = @project.milestones.build(milestone_params)

    if @milestone.save
      redirect_to @project, notice: 'Milestone was successfully created.'
    else
      @milestones = @project.milestones.order(:created_at)
---
INSERT INTO "milestones" ("title", "description", "amount_cents", "currency", "status", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" = $1 ORDER BY "milestones"."created_at" ASC  [["project_id", 7]]

  def update
    if @milestone.update(milestone_params)
---
UPDATE "milestones" SET "amount_cents" = $1, "currency" = $2, "updated_at" = $3 WHERE "milestones"."id" = $4  [["amount_cents", 100], ["currency", "INR"], ["updated_at", "2025-08-21 17:30:50.308312"], ["id", 15]]

  def fund
    if @milestone.can_be_funded?
      # TODO: Integrate with Stripe payment
      @milestone.update!(status: :funded)
---
UPDATE "milestones" SET "status" = $1, "updated_at" = $2 WHERE "milestones"."id" = $3  [["status", 1], ["updated_at", "2025-08-21 09:07:06.007909"], ["id", 8]]

  def refund
    if @milestone.can_be_refunded?
      # TODO: Integrate with Stripe refund
      @milestone.update!(status: :refunded)
---
UPDATE "milestones" SET "status" = $1, "updated_at" = $2 WHERE "milestones"."id" = $3  [["status", 4], ["updated_at", "2025-08-21 09:07:11.886194"], ["id", 8]]

  def set_milestone
    @milestone = @project.milestones.find(params[:id])
---
SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" = $1 AND "milestones"."id" = $2 LIMIT $3  [["project_id", 7], ["id", 15], ["LIMIT", 1]]