app/controllers/payments_controller.rb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def create_checkout_session
    milestone = Milestone.find(params[:milestone_id])

SELECT "milestones".* FROM "milestones" WHERE "milestones"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "milestones" SET "status" = $1, "updated_at" = $2 WHERE "milestones"."id" = $3  [["status", 1], ["updated_at", "2025-08-21 17:38:43.563991"], ["id", 15]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."milestone_id" = $1 ORDER BY "transactions"."created_at" DESC LIMIT $2  [["milestone_id", 15], ["LIMIT", 1]]
---
  def success
    milestone_id = params[:milestone_id]
    milestone = Milestone.find_by(id: milestone_id)

    if milestone && milestone.project.client == current_user
      # For testing: Update milestone status directly
      # In production, this should be handled by webhooks
      if milestone.pending?
        milestone.update!(status: :funded)

        # Update the most recent transaction for this milestone
        transaction = milestone.transactions.order(:created_at).last