app/controllers/projects_controller.rb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" IN ($1, $2)  [["project_id", 4], ["project_id", 6]]
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = $1  [["client_id", 7]]
---
  def index
    if current_user.client?
      @projects = current_user.client_projects.includes(:milestones, :developer)

SELECT "milestones".* FROM "milestones" WHERE "milestones"."project_id" = $1 ORDER BY "milestones"."created_at" ASC  [["project_id", 4]]
---
  def show
    @milestones = @project.milestones.order(:created_at)

INSERT INTO "projects" ("title", "description", "client_id", "developer_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @project = current_user.client_projects.build(project_params)

    if @project.save

UPDATE "projects" SET "status" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["status", 1], ["updated_at", "2025-08-21 10:25:43.453553"], ["id", 7]]
---
  def update
    if @project.update(project_params)